src/Catalogs/уатПараметрыВыработки/уатПараметрыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПараметрыВыработки</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>ВесГруза</name>
      <description>Вес груза</description>
    </items>
    <items>
      <name>ВнеРасписания</name>
      <description>Вне расписания</description>
    </items>
    <items>
      <name>ВремяВНаряде</name>
      <description>Время в наряде</description>
    </items>
    <items>
      <name>ВремяВПростое</name>
      <description>Время в простое</description>
    </items>
    <items>
      <name>ВремяВПростоеСВклДвигателем</name>
      <description>Время в простое с вкл двигателем</description>
    </items>
    <items>
      <name>ВремяВРаботе</name>
      <description>Время в работе</description>
    </items>
    <items>
      <name>ВремяВРаботеПоДаннымGPS</name>
      <description>Время в работе по данным мониторинга</description>
    </items>
    <items>
      <name>ВремяВРемонте</name>
      <description>Время в ремонте</description>
    </items>
    <items>
      <name>ВремяДневное</name>
      <description>Время дневное</description>
    </items>
    <items>
      <name>ВремяНочное</name>
      <description>Время ночное</description>
    </items>
    <items>
      <name>ВремяОжидания</name>
      <description>Время ожидания</description>
    </items>
    <items>
      <name>ВремяРаботыВВыходныеДни</name>
      <description>Время работы в выходные дни</description>
    </items>
    <items>
      <name>ВремяПраздничное</name>
      <description>Время работы в праздничные дни</description>
    </items>
    <items>
      <name>ВремяСпециальнойРаботы</name>
      <description>Время специальной работы</description>
    </items>
    <items>
      <name>КоличествоВодителей</name>
      <description>Количество водителей</description>
    </items>
    <items>
      <name>КоличествоДней</name>
      <description>Количество дней</description>
    </items>
    <items>
      <name>КоличествоЕздок</name>
      <description>Количество ездок</description>
    </items>
    <items>
      <name>КоличествоЗаказов</name>
      <description>Количество заказов</description>
    </items>
    <items>
      <name>КоличествоКонтейнеров</name>
      <description>Количество контейнеров</description>
    </items>
    <items>
      <name>КоличествоОпераций</name>
      <description>Количество операций</description>
    </items>
    <items>
      <name>КоличествоТочекПоВидуОперации</name>
      <description>Количество операций погрузки и разгрузки</description>
    </items>
    <items>
      <name>КоличествоПассажиров</name>
      <description>Количество пассажиров</description>
    </items>
    <items>
      <name>КоличествоПривлеченныхТС</name>
      <description>Количество привлеченных ТС</description>
    </items>
    <items>
      <name>КоличествоРейсов</name>
      <description>Количество рейсов (маршрутных листов)</description>
    </items>
    <items>
      <name>КоличествоСобственныхТС</name>
      <description>Количество собственных ТС</description>
    </items>
    <items>
      <name>КоличествоТочек</name>
      <description>Количество точек</description>
    </items>
    <items>
      <name>КоличествоТочекПоТипуПункта</name>
      <description>Количество точек по типу пункта</description>
    </items>
    <items>
      <name>КоличествоТС</name>
      <description>Количество ТС</description>
    </items>
    <items>
      <name>КоличествоУпаковок</name>
      <description>Количество упаковок</description>
    </items>
    <items>
      <name>ОбъемКм</name>
      <description>м3 км</description>
    </items>
    <items>
      <name>Наценка</name>
      <description>Наценка</description>
    </items>
    <items>
      <name>НочнаяДоставка</name>
      <description>Ночная доставка</description>
    </items>
    <items>
      <name>Объем</name>
      <description>Объем груза</description>
    </items>
    <items>
      <name>ПогрузочноРазгрузочныеРаботы</name>
      <description>Погрузочно разгрузочные работы</description>
    </items>
    <items>
      <name>Подача</name>
      <description>Подача</description>
    </items>
    <items>
      <name>ПревышениеВеса</name>
      <description>Превышение веса</description>
    </items>
    <items>
      <name>ПревышениеВысоты</name>
      <description>Превышение высоты</description>
    </items>
    <items>
      <name>ПревышениеДлины</name>
      <description>Превышение длины</description>
    </items>
    <items>
      <name>ПревышениеОбъема</name>
      <description>Превышение объема</description>
    </items>
    <items>
      <name>ПревышениеШирины</name>
      <description>Превышение ширины</description>
    </items>
    <items>
      <name>ПробегВнеГеозоны</name>
      <description>Пробег вне геозоны</description>
    </items>
    <items>
      <name>ПробегВнеГеозоныПоВидуОперации</name>
      <description>Пробег вне геозоны по виду операции в пункте</description>
    </items>
    <items>
      <name>ПробегВнеГеозоныПоТипуПункта</name>
      <description>Пробег вне геозоны по типу пункта</description>
    </items>
    <items>
      <name>ПробегНаБуксире</name>
      <description>Пробег на буксире</description>
    </items>
    <items>
      <name>ПробегОбщий</name>
      <description>Пробег общий</description>
    </items>
    <items>
      <name>ПробегОбщийПоДаннымGPS</name>
      <description>Пробег общий по данным мониторинга</description>
    </items>
    <items>
      <name>ПробегПорожний</name>
      <description>Пробег порожний</description>
    </items>
    <items>
      <name>ПробегСГрузом</name>
      <description>Пробег с грузом</description>
    </items>
    <items>
      <name>ПробегСПассажирами</name>
      <description>Пробег с пассажирами</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы</name>
      <description>Пробег специальной работы</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы2</name>
      <description>Пробег специальной работы 2</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы3</name>
      <description>Пробег специальной работы 3</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы4</name>
      <description>Пробег специальной работы 4</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы5</name>
      <description>Пробег специальной работы 5</description>
    </items>
    <items>
      <name>ПростойПодПогрузкой</name>
      <description>Простой под погрузкой</description>
    </items>
    <items>
      <name>ПростойПодРазгрузкой</name>
      <description>Простой под разгрузкой</description>
    </items>
    <items>
      <name>РасходТопливаВДвижении</name>
      <description>Расход топлива в движении</description>
    </items>
    <items>
      <name>РасходТопливаВПростое</name>
      <description>Расход топлива в простое</description>
    </items>
    <items>
      <name>РасходТопливаДУТ</name>
      <description>Расход топлива ДУТ</description>
    </items>
    <items>
      <name>СкладскаяОбработка</name>
      <description>Складская обработка</description>
    </items>
    <items>
      <name>СтоимостьКмПробега</name>
      <description>Стоимость 1 км пробега</description>
    </items>
    <items>
      <name>СтоимостьГруза</name>
      <description>Стоимость груза</description>
    </items>
    <items>
      <name>ТнКм</name>
      <description>Тн км</description>
    </items>
    <items>
      <name>УровеньУтилизации</name>
      <description>Уровень утилизации</description>
    </items>
    <items>
      <name>ФактическийРасходГСМ</name>
      <description>Фактический расход ГСМ (основного топлива)</description>
    </items>
    <items>
      <name>ФактическоеВремяОпоздания</name>
      <description>Фактическое время опоздания</description>
    </items>
    <items>
      <name>ФактическоеВремяПростоя</name>
      <description>Фактическое время простоя</description>
    </items>
  </predefined>
  <attributes>
    <name>АлгоритмРасчетаПараметра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентДоходовРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПараметра</name>
    <comment>(Itob)</comment>
    <type>
      <types>EnumRef.ItobВидыПараметровВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботыСотрудника</name>
    <type>
      <types>CatalogRef.ВидыРаботСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУпаковки</name>
    <type>
      <types>CatalogRef.уатВидыУпаковки_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>Временный</name>
    <comment>Признак того, что параметр временной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСотрудников</name>
    <comment>Действует на сотрудников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСотрудниковМЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТС</name>
    <comment>Действует на ТС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТСМЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВДопВыработкеМЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВСпецработахПЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВТарифахНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляЗаказовИПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляМаршрутныхЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолученияФактЗначенийДляПривлТС</name>
    <type>
      <types>EnumRef.уатИсточникиФактДанныхПоказателейПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолученияФактЗначенийДляСобственногоТС</name>
    <type>
      <types>EnumRef.уатИсточникиФактДанныхПоказателейПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеДатчика</name>
    <comment>(Itob)</comment>
    <type>
      <types>CatalogRef.ItobНазначенияДатчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВВидеФлага</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВыработкиОС</name>
    <comment>Параметр выработки ОС</comment>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПревышения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьВПромежуточныхПунктах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьПриПогрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьПриРазгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СводныйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаЗначений</name>
    <type>
      <types>EnumRef.уатСпособыВводаЗначенийВыработкивМЛ_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПараметровВыработки</name>
    <type>
      <types>EnumRef.уатСпособРасчетаПараметровВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПоНомеруЭтапа</name>
    <comment>0 - суммировать значения, 1 - выбирать максимальное значение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтейнера</name>
    <type>
      <types>CatalogRef.уатТипыКонтейнеров_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПункта</name>
    <type>
      <types>CatalogRef.уатТипыПунктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТочкиМаршрута</name>
    <type>
      <types>EnumRef.уатТипыТочекМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>УвеличитьОбщийПробегНаПробегСпец</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОтбора</name>
    <comment>(Itob)</comment>
    <attributes>
      <name>Показатель</name>
      <comment>(Itob)</comment>
      <type>
        <types>CatalogRef.ItobНазначенияДатчиков</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <comment>(Itob)</comment>
      <type>
        <types>EnumRef.ItobВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>(Itob)</comment>
      <type>
        <types>EnumRef.ItobСостоянияТерминалов</types>
        <types>Number</types>
        <types>CatalogRef.уатГеозоны_уэ</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/уатСпособРасчетаПараметровВыработки/уатСпособРасчетаПараметровВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСпособРасчетаПараметровВыработки</name>
  <enumValues>
    <name>КоличествоКонтейнеровПоТипуКонтейнера</name>
  </enumValues>
  <enumValues>
    <name>КоличествоОперацийПоТипуТочкиМаршрута</name>
  </enumValues>
  <enumValues>
    <name>КоличествоТочекПоТипуПункта</name>
  </enumValues>
  <enumValues>
    <name>КоличествоУпаковокПоВидуУпаковки</name>
  </enumValues>
  <enumValues>
    <name>НеРассчитывать</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаданию</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамИМаршрутнымЛистам</name>
  </enumValues>
  <enumValues>
    <name>ПоПараметруВыработки</name>
  </enumValues>
  <enumValues>
    <name>ПоТТД</name>
  </enumValues>
  <enumValues>
    <name>ПоШапке</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатПараметрыВыработки/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Только складская обработка не рассчитывается в документах ТТД.
	Если НЕ ИспользоватьВТарифахНаУслуги
		И ИмяПредопределенныхДанных <> "СкладскаяОбработка"
		И ИмяПредопределенныхДанных <> "ПревышениеВеса"
		И ИмяПредопределенныхДанных <> "ПревышениеОбъема"
		И ИмяПредопределенныхДанных <> "ПревышениеВысоты"
		И ИмяПредопределенныхДанных <> "ПревышениеДлины"
		И ИмяПредопределенныхДанных <> "ПревышениеШирины"
		И ИмяПредопределенныхДанных <> "НочнаяДоставка"
		И ИмяПредопределенныхДанных <> "Наценка"
		И НЕ СводныйПоказатель Тогда
		ИспользоватьВТарифахНаУслуги = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ИспользоватьДляМаршрутныхЛистов Тогда
		ПроверяемыеРеквизиты.Добавить("СпособВводаЗначений");
	КонецЕсли;
	
	Если СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.КоличествоОперацийПоТипуТочкиМаршрута Тогда
		ПроверяемыеРеквизиты.Добавить("ТипТочкиМаршрута");
	КонецЕсли;
	Если СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.КоличествоТочекПоТипуПункта Тогда
		ПроверяемыеРеквизиты.Добавить("ТипПункта");
	КонецЕсли;
	Если СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.КоличествоУпаковокПоВидуУпаковки Тогда
		ПроверяемыеРеквизиты.Добавить("ВидУпаковки");
	КонецЕсли;
	Если СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.КоличествоКонтейнеровПоТипуКонтейнера Тогда
		ПроверяемыеРеквизиты.Добавить("ТипКонтейнера");
	КонецЕсли;
	Если СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.ПоПараметруВыработки Тогда
		ПроверяемыеРеквизиты.Добавить("БазовыйПараметрВыработки");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпособРасчетаПараметровВыработки)
		И (СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.ПоШапке
		ИЛИ СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.ПоЗаданию
		ИЛИ СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.ПоТТД
		ИЛИ СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.ПоЗаказамИМаршрутнымЛистам) Тогда
		ПроверяемыеРеквизиты.Добавить("АлгоритмРасчетаПараметра");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
